Revit 2026 API

# BrowserOrganizationGetFolderItems Method

---

Returns a collection of leaf FolderItemInfo objects each containing the given element Id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FolderItemInfo> GetFolderItems(
	ElementId elementId
)
```
```vb
Public Function GetFolderItems (
	elementId As ElementId
) As IList(Of FolderItemInfo)
```
```cpp
public:
IList<FolderItemInfo^>^ GetFolderItems(
	ElementId^ elementId
)
```
```fsharp
member GetFolderItems :
        elementId : ElementId -> IList<FolderItemInfo>
```

#### Parameters

elementId ElementId
     Element id located at a leaf position in the project browser.

#### Return Value

IListFolderItemInfo An array of FolderItemInfo objects.

| Exception | Condition |
| --- | --- |
| ArgumentException | elementId is not a valid Element identifier. |
| ArgumentNullException | A non-optional argument was null |

Each returned FolderItemInfo includes the folder name and the corresponding folder parameter Id.

#### Reference

BrowserOrganization Class

Autodesk.Revit.DB Namespace